def analyze_news(title, summary=""):

    text = f"""
🌸 AnimeVerse AI

🔥 خبر جدید دنیای انیمه

🎬 عنوان:
{title}


🇮🇷 خلاصه فارسی:
{summary}


✨ تحلیل AnimeVerse:
این اتفاق می‌تواند برای طرفداران دنیای انیمه مهم باشد.
با توجه به نوع خبر، احتمالاً توجه زیادی از طرف جامعه انیمه دریافت خواهد کرد.


🎭 دسته‌بندی:
📰 اخبار رسمی انیمه


⭐ ارزش پیگیری:
8/10


💫 AnimeVerse توصیه می‌کند:
اگر به دنبال دنبال کردن جدیدترین اتفاقات دنیای انیمه هستید، این خبر را از دست ندهید.


━━━━━━━━━━━━━━
"""

    return text